DROP DATABASE deanery;

CREATE DATABASE deanery; 

\connect deanery

create schema main;



create type sex_type as enum('М', 'Ж');
create type aud_type as enum('Поточная', 'Семинарская');

CREATE FUNCTION dn_now() RETURNS timestamp with time zone
    LANGUAGE sql IMMUTABLE
    AS $$SELECT '2021-10-04 10:00:00'::TIMESTAMP AT TIME ZONE 'Europe/Moscow';$$;

create table Auditoriums(
	id serial primary key check (id > 0),
	name varchar(50) not null,
	"type" aud_type not null,
	floor smallint not null
);

create table Groups(
	id serial primary key check (id > 0),
	name varchar(50) not null,
	course smallint not null check(course > 0),
	specialtie varchar(100) not null
);

create table GroupsAuditoriums(
	group_id integer not null check(group_id > 0) references Groups on delete cascade,
	aud_id integer not null check(aud_id > 0) references Auditoriums on delete cascade,
	primary key (group_id, aud_id)
);

create table Quarantines(
	id serial primary key check (id > 0),
	group_id integer not null check(group_id > 0) references Groups on delete cascade,
	start date not null
);

create table Certificates(
	id serial primary key check (id > 0) ,
	series char(16) unique not null,
	date_of_issue date not null,
	issuing_authority varchar(200) not null
);

create table Vaccinations(
	id serial primary key check (id > 0),
	name varchar(50) not null,
	series varchar(50) unique not null,
	date_of_vac date not null,
	place varchar(200) not null,
	full_name_of_doctor varchar(200) not null
);

create table CertificatesVaccinations(
	certificate_id integer not null check(certificate_id > 0) references Certificates on delete cascade,
	vacc_id integer not null check(vacc_id > 0) references Vaccinations on delete cascade,
	primary key (certificate_id, vacc_id)
);

 
create table Students(
	id serial primary key check (id > 0),
	student_doc_id char(8) not null,
	full_name varchar(200) not null,
	date_of_birth date not null,
	enrollment_date date not null,
	group_id integer not null check(group_id > 0) references Groups on delete restrict,
	sex sex_type not null,
	vacc_certificate_id integer null check(vacc_certificate_id > 0) references Certificates on delete set null,
	phone_number varchar(50) not null,
	mail varchar(100) not null,
	settlement varchar(50) not null, 
	street varchar(50) not null,
	house_number varchar(10) not null,
	flat_number smallint not null check(flat_number > 0),
	unique(student_doc_id),
	unique(vacc_certificate_id)
);


create table Sicks(
	id serial primary key check (id > 0),
	student_id integer not null check (id > 0) references Students on delete cascade,
	beg_sick date not null,
	end_of_sick date null
);

insert into auditoriums(name, "type", floor) values
('П1', 'Поточная', 1),
('П2', 'Поточная', 1),
('П3', 'Поточная', 1),
('П4', 'Поточная', 1),
('П5', 'Поточная', 3),
('П6', 'Поточная', 3),
('101', 'Семинарская', 1),
('102', 'Семинарская', 1),
('103', 'Семинарская', 1),
('201', 'Семинарская', 2),
('202', 'Семинарская', 2),
('203', 'Семинарская', 2),
('204', 'Семинарская', 2),
('301', 'Семинарская', 3),
('302', 'Семинарская', 3),
('303', 'Семинарская', 3),
('304', 'Семинарская', 3),
('305', 'Семинарская', 3),
('306', 'Семинарская', 3),
('307', 'Семинарская', 3);

insert into groups(name, course, specialtie) values
('М-101', 1, 'Мехатроника'),
('М-201', 2, 'Мехатроника'),
('М-301', 3, 'Мехатроника'),
('М-401', 4, 'Мехатроника'),
('М-501', 5, 'Мехатроника'),
('М-601', 6, 'Мехатроника'),
('Р-101', 1, 'Робототехника'),
('Р-201', 2, 'Робототехника'),
('Р-301', 3, 'Робототехника'),
('Р-401', 4, 'Робототехника'),
('Р-501', 5, 'Робототехника'),
('Р-601', 6, 'Робототехника'),
('Э-101', 1, 'Электрохимия'),
('Э-201', 2, 'Электрохимия'),
('Э-301', 3, 'Электрохимия'),
('Э-401', 4, 'Электрохимия'),
('Э-102', 1, 'Электрохимия'),
('Э-202', 2, 'Электрохимия');


insert into GroupsAuditoriums(group_id, aud_id) values
(1, 1),
(1, 7),
(2, 1),
(2, 8),
(3, 2),
(3, 9),
(4, 2),
(4, 9),
(4, 10),
(5, 3),
(5, 11),
(6, 3),
(6, 12),
(7, 4),
(7, 13),
(8, 4),
(8, 14),
(9, 5),
(9, 15),
(10, 5),
(10, 16),
(11, 6),
(11, 17),
(12, 6),
(12, 18),
(13, 1),
(13, 19),
(14, 1),
(14, 19),
(15, 1),
(15, 19),
(16, 1),
(16, 12),
(17, 1),
(17, 11),
(18, 11),
(18, 1);

insert into Quarantines(group_id, start) values
(4, '2020-01-01'),
(4, '2021-01-01'),
(1, '2021-10-02'),
(3, '2020-03-10'),
(2, '2020-09-25'),
(1, '2021-09-10'),
(8, '2020-11-05'),
(8, '2020-05-09'),
(12, '2020-03-12'),
(15, '2021-09-15'),
(15, '2020-09-10');


insert into Certificates(series, date_of_issue, issuing_authority) values
('0001000100010001', '2020-01-15', 'Московская поликлиника №1'),
('0001000100010002', '2020-01-15', 'Московская поликлиника №1'),
('8000100011112222', '2020-01-15', 'Московская поликлиника №1'),
('1111222233334444', '2020-01-15', 'Московская поликлиника №1'),
('2222111133334444', '2021-09-23', 'Московская поликлиника №2'),
('1248427893423242', '2020-01-22', 'Нижневартовская поликлиника №1'),
('1571238523457234', '2020-07-05', 'Королёвская поликлиника №4'),
('4123423543334553', '2021-01-23', 'Сургутская поликлиника №1'),
('4325432658349333', '2021-04-12', 'Королёвская поликлиника №1'),
('3333444422222222', '2020-02-27', 'Московская поликлиника №22'),
('1111111111111122', '2021-12-11', 'Московская поликлиника №44'),
('9572348952347533', '2021-03-13', 'Королёвская поликлиника №4'),
('4589273450987585', '2021-04-30', 'Мытищинская поликлиника №1');

insert into Vaccinations(name, series, date_of_vac, place, full_name_of_doctor) values
('Гам-КОВИД-Вак', '123456789', '2019-12-20', 'Московская поликлиника №1', 'Хачатарян Алла Альбертовна'),
('Гам-КОВИД-Вак', '123456790', '2019-12-20', 'Московская поликлиника №1', 'Хачатарян Алла Альбертовна'),
('Гам-КОВИД-Вак', '123456791', '2019-12-20', 'Московская поликлиника №1', 'Хачатарян Алла Альбертовна'),
('Гам-КОВИД-Вак', '123456792', '2019-12-20', 'Московская поликлиника №1', 'Хачатарян Алла Альбертовна'),

('Гам-КОВИД-Вак', 'II-123123', '2020-01-15', 'Московская поликлиника №1', 'Айтуразов Аймыр Аймырович'),
('Гам-КОВИД-Вак', 'II-123124', '2020-01-15', 'Московская поликлиника №1', 'Айтуразов Аймыр Аймырович'),
('Гам-КОВИД-Вак', 'II-123125', '2020-01-15', 'Московская поликлиника №1', 'Айтуразов Аймыр Аймырович'),
('Гам-КОВИД-Вак', 'II-123126', '2020-01-15', 'Московская поликлиника №1', 'Айтуразов Аймыр Аймырович'),

('Гам-КОВИД-Вак', '123494942', '2021-09-03', 'Московская поликлиника №2', 'Алтурин Михаил Федорович'),
('Гам-КОВИД-Вак', 'II-123312', '2021-09-23', 'Московская поликлиника №2', 'Мирин Фёдор Евгеньевич'),

('Гам-КОВИД-Вак', '239953434', '2020-10-22', 'Московская поликлиника №23', 'Кыгдык Тыгдык Тыгдыкович'),
('Гам-КОВИД-Вак', 'II-123221', '2020-01-22', 'Нижневартовская поликлиника №1', 'Романов Петр Петрович'),

('Гам-КОВИД-Вак', '138913423', '2020-06-14', 'Королёвская поликлиника №1', 'Лермонтов Михаил Юрьевич'),
('Гам-КОВИД-Вак', 'II-223456', '2020-07-05', 'Королёвская поликлиника №1', 'Лермонтов Михаил Юрьевич'),

('Гам-КОВИД-Вак', '398548395', '2020-12-22', 'Сургутская поликлиника №1', 'Петрова Анна Григорьевна'),
('Гам-КОВИД-Вак', 'II-541234', '2021-01-23', 'Сургутская поликлиника №1', 'Пушкин Александр Сергеевич'),

('Гам-КОВИД-Вак', '398548396', '2021-03-22', 'Сургутская поликлиника №1', 'Петрова Анна Григорьевна'),
('Гам-КОВИД-Вак', 'II-541235', '2021-04-12', 'Сургутская поликлиника №1', 'Пушкин Александр Сергеевич'),

('Гам-КОВИД-Вак', '321222133', '2020-02-01', 'Московская поликлиника №22', 'Аброзьев Перт Михайлович'),
('Гам-КОВИД-Вак', 'II-333456', '2020-02-27', 'Московская поликлиника №22', 'Аброзьев Перт Михайлович'),

('Гам-КОВИД-Вак', '444442222', '2020-11-20', 'Московская поликлиника №44', 'Аронян Арон Аронович'),
('Гам-КОВИД-Вак', 'II-333333', '2020-12-11', 'Московская поликлиника №44', 'Аронянова Наталья Ароновна'),

('Гам-КОВИД-Вак', '557899977', '2021-02-19', 'Королёвская поликлиника №4', 'Лермонтов Михаил Юрьевич'),
('Гам-КОВИД-Вак', 'II-955283', '2021-03-13', 'Королёвская поликлиника №4', 'Лермонтов Михаил Юрьевич'),

('ЭпиВакКорона', '456754674', '2021-03-15', 'Мытищинская поликлиника №1', 'Лоаран Генрих Индрович'),
('ЭпиВакКорона', 'II-634786', '2021-04-30', 'Мытищинская поликлиника №1', 'Лоаран Генрих Индрович');





insert into CertificatesVaccinations(certificate_id, vacc_id) values
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(1, 5),
(2, 6),
(3, 7),
(4, 8),
(5, 9),
(5, 10),
(6, 11),
(6, 12),
(7, 13),
(7, 14),
(8, 15),
(8, 16),
(9, 17),
(9, 18),
(10, 19),
(10, 20),
(11, 21),
(11, 22),
(12, 23),
(12, 24),
(13, 25),
(13, 26);



insert into Students(student_doc_id, full_name, date_of_birth, enrollment_date, group_id, sex, vacc_certificate_id, phone_number, mail, settlement, street, house_number, flat_number) values
('00000001', 'Аррат Арат Аратович', '2001-01-01', '2021-08-17', 1, 'М', 1, '79775887844', 'ararat@gmail.com', 'Москва', 'Пушкина', '10A', 25),
('00000002', 'Майран Игорь Григорьевич', '2001-01-01', '2021-08-17', 1, 'М', null, '79773827834', 'neararat@gmail.com', 'Москва', 'Ленина', '11', 1),
('00000003', 'Линь Аделаида Михайловна', '2001-01-12', '2021-08-17', 1, 'Ж', 2, '7977344844', 'adel@gmail.com', 'Королёв', 'Пушкина', '10', 22),

('00000004', 'Аррат Игорь Аратович', '2000-08-17', '2020-08-17', 2, 'М', null, '79771234444', 'poshadi1@gmail.com', 'Москва', 'Пушкина', '10A', 25),
('00000005', 'Матронин Дмитрий Дмитрьевич', '2000-03-17', '2020-08-17', 2, 'М', 3, '79775122224', 'poshadi2@gmail.com', 'Мытищи', 'Мира', '8A', 12),
('00000006', 'Алин Ар Атов', '2000-02-15', '20210-08-07', 2, 'М', null, '7977344844', 'poshadi3@gmail.com', 'Москва', 'Пушкина', '13', 11),

('00000007', 'Ортов Алберт Викторвич', '1999-11-22', '2019-08-17', 3, 'М', 4, '7978900021', 'ortov@gmail.com', 'Москва', 'Мира', '81', 22),
('00000008', 'Миртов Альбер Езофович', '1999-01-30', '2019-08-17', 3, 'М', 5, '7922223123', 'mirtov@gmail.com', 'Королёв', 'Парковая', '10', 32),

('00000009', 'Филтон Алена Михайловна', '1998-11-11', '2018-08-17', 4, 'Ж', null, '7912344844', 'filton@gmail.com', 'Москва', 'Паркова', '10', 2),
('00000010', 'Микринова Дарья Егоровна', '1998-12-12', '2018-08-17', 4, 'Ж', null, '7921344844', 'mikrinova@gmail.com', 'Королёв', 'Пушкина', '1', 62),

('00000011', 'Гебельс Игорь Сергеевич', '1997-01-12', '2017-08-17', 5, 'М', 6, '7984344844', 'propaganda1@gmail.com', 'Королёв', 'Пушкина', '10', 22),
('00000012', 'Рунцеевич Йозеф Генрихович', '1997-07-22', '2017-08-17', 5, 'М', 7, '7900044844', 'propaganda2@gmail.com', 'Королёв', 'Пушкина', '10', 22),

('00000013', 'Афер Антон Юрьевич', '1996-01-12', '2016-08-17', 6, 'М', null, '7912358464', 'aferr@gmail.com', 'Королёв', 'Пушкина', '10', 16),
('00000014', 'Рунецеевич Игорь Григорьевич', '1996-01-12', '2016-08-17', 6, 'М', null, '79733322694', 'runrun@gmail.com', 'Мытищи', 'Вовровского', '10', 7),

('00000015', 'Мартынов Арарат Араратович', '2001-01-01', '2021-08-17', 7, 'М', 8, '7995862844', 'martiove@gmail.com', 'Москва', 'Ленина', '7', 100),
('00000016', 'Фуинь Юрий Викторович', '2001-04-11', '2021-08-17', 7, 'М', null, '7996644844', 'fyin1@gmail.com', 'Москва', 'Пушкина', '11', 222),

('00000017', 'Кринь Михаил Михайловна', '2000-03-12', '2020-08-17', 8, 'М', 9, '7977666844', 'crinnn@gmail.com', 'Москва', 'Ленина', '16', 71),
('00000018', 'Минь Виктор Юрьевич', '2000-04-15', '2020-08-17', 8, 'М', null, '7977344888', 'minnn@gmail.com', 'Москва', 'Ленина', '9A', 4),

('00000019', 'Цин Аделаида Михайловна', '1999-01-12', '2019-08-17', 9, 'Ж', 10, '7977774133', 'zhin@gmail.com', 'Москва', 'Мира', '10', 03),
('00000020', 'Тао Анна Михайловна', '1999-11-13', '2019-08-17', 9, 'Ж', 11, '7977383844', 'tao@gmail.com', 'Москва', 'Пушкина', '33', 11),
('00000021', 'Чао Юрий Михайлович', '1999-12-14', '2019-08-17', 9, 'М', 12, '7977327844', 'chao@gmail.com', 'Москва', 'Пушкина', '12B', 3),

('00000022', 'Чжао Игорь Юрьевич', '1998-01-01', '2018-08-17', 10, 'М', null, '7977345373', 'chzao@gmail.com', 'Москва', 'Парковая', '7', 2),

('00000023', 'Мяо Игорь Дмитрьевич', '1997-02-18', '2017-08-17', 11, 'М', null, '7999323157', 'myao@gmail.com', 'Москва', 'Воровского', '8', 5),

('00000024', 'Ляо Антон Сергеевич', '1996-03-02', '2016-08-17', 12, 'М', null, '7977300998', 'lyao@gmail.com', 'Москва', 'Парковая', '9', 7),

('00000025', 'Пяо Сергей Сергеевич', '2001-03-12', '2021-08-17', 13, 'М', null, '7973457922', 'pyao@gmail.com', 'Москва', 'Парковая', '10', 22),

('00000026', 'Фяо Александр Александрович', '2000-01-22', '2020-08-17', 14, 'М', null, '7976593543', 'fyao@gmail.com', 'Москва', 'Пушкина', '11', 33),

('00000027', 'Ряо Алексей Александрович', '1999-05-13', '2019-08-17', 15, 'М', null, '7973458954', 'ryao@gmail.com', 'Москва', 'Ленина', '12', 10),

('00000028', 'Кяо Александр Алексеевич', '1998-06-01', '2018-08-17', 16, 'М', null, '7977237777', 'kyao@gmail.com', 'Москва', 'Ленина', '13', 66),

('00000029', 'Лио Алексей Алексеевич', '2001-01-24', '2021-08-17', 17, 'М', null, '7977377777', 'lio@gmail.com', 'Москва', 'Пушкина', '14', 22),

('00000030', 'Цао Анна Михайловна', '2000-10-21', '2020-08-17', 18, 'Ж', 13, '7977777777', 'zzzaaoo@gmail.com', 'Москва', 'Пушкина', '14', 22);



insert into Sicks(student_id, beg_sick, end_of_sick) values
(1,'2021-10-03', null),
(2,'2021-10-02', null),
(3,'2021-10-01', null),
(9,'2020-01-01', '2020-01-17'),
(10, '2020-01-01', '2020-01-30'),
(9,'2021-01-01', '2021-05-20'),
(7, '2020-03-10', '2020-05-12'),
(4, '2020-09-25', '2020-10-25'),
(2, '2021-09-10', '2021-09-30'),
(17, '2020-11-05', '2020-11-25'),
(17, '2020-05-09', '2020-05-29'),
(24, '2020-03-12', '2020-03-28'),
(27, '2021-09-15', '2021-09-30'),
(27, '2020-09-10', '2020-09-24');













